/**
 * 32路舵机控制板
 */

void setup() {
  // put your setup code here, to run once:
  Serial.begin(9600);    // 设置波特率为9600
}

void loop() {
  // put your main code here, to run repeatedly:
  Serial.print("#1P1500#2P1500#3P1500#4P1500#5P1500#6P1500#7P1500#8P1500#9P1500#10P1500#11P1500#12P1500#13P1500#14P1500#15P1500#16P1500#17P1500#18P1500#19P1500#20P1500T5000\r\n");  // S1号舵机旋转到脉宽为800的位置，使用时间1000ms
  delay(5000);  // 延时1000ms，舵机刚好执行完上一条命令
  delay(10000);
  Serial.print("#1P500#2P500#3P500#4P500#5P500#6P500#7P500#8P500#9P500#10P500#11P500#12P500#13P500#14P500#15P500#16P500#17P500#18P500#19P500#20P500T7000\r\n");  // S1号舵机旋转到脉宽为800的位置，使用时间1000ms
  delay(7000);  // 延时1000ms，舵机刚好执行完上一条命令
  delay(10000);
}
